[
    {
        "id": "j04",
        "name": "Azalea Town",
        "description": "Azalea Town (Japanese: ヒワダタウン Hiwada Town) is a small, isolated town located on the southern peninsula of the Johto region. The town is best known for being the residence of Kurt, a custom Poké Ball creator who makes Poké Balls out of Apricorns. He lives in the northwest portion of town on the east edge of Ilex Forest. Azalea features other notable locations as well, such as the Slowpoke Well. As such, Slowpoke can be found around the town. The town has two entrances, Route 33 to the east and Ilex Forest to the west. Pokémon Trainers must journey to Azalea Town in order to win the Hive Badge from Bugsy, the Azalea Gym Leader who specializes in Bug-type Pokémon.",
        "region": "Johto",
        "real_name": "Minabe Village, Wakayama (Japanese: みなべ町 和歌山県)",
        "real_image": [
            "minabe.jpeg"
        ],
        "real_notes": "Minabe is famous for its high-quality Japanese apricots, known as ubame, and high-quality charcoal, known as Binchōtan.",
        "width": 1.6,
        "height": 5.3,
        "top": 80.5,
        "left": 23.9
    },
    {
        "id": "bf",
        "name": "Battle Frontier",
        "description": "The Frontier Access (Japanese: フロンティアフロント Frontier Front) is a location in Johto. It debuted in Pokémon HeartGold and SoulSilver. Located to the west of Olivine City, the Frontier Access immediately connects to Route 40 to the south and the Battle Frontier to the north. It is a small town situated as a staging area for challengers to the Battle Frontier, much like the Fight Area. It also features different prize redemption shops where Battle Points can be used. The player cannot enter the Frontier Access until after they have entered the Hall of Fame.,",
        "region": "Johto",
        "width": 1,
        "height": 2.5,
        "top": 47,
        "left": 13
    },
    {
        "id": "j10",
        "name": "Blackthorn City",
        "description": "Blackthorn City (Japanese: フスベシティ Fusube City) is a city located in northeast Johto. Pokémon Trainers often come to Blackthorn City in order to win the Rising Badge from Clair, the Blackthorn Gym Leader, who specializes in Dragon-type Pokémon. Many famous Dragon-type Trainers, including Clair and Lance, come from Blackthorn City. According to a resident in Blackthorn, most Trainers in the city end up being Dragon-type specialists. This could be because of the Dragon's Den in the area and because the local Gym Leader is a Dragon-type Trainer.",
        "real_name": "Shirakawa-go and Gifu City, Gifu (Japanese: 白川郷+岐阜市 岐阜県",
        "real_image": [
            "gifu.jpeg",
            "Shirakawa.jpeg"
        ],
        "real_notes": "Shiragawa-go is a world heritage site in Shiragawa Village (near Takayama City), which is located near Shō River. Geographically it is placed closer to Gifu City, near Nagara River.",
        "region": "Johto",
        "width": 2.2,
        "height": 7,
        "top": 37.8,
        "left": 40.4
    },
    {
        "id": "k07",
        "name": "Celadon City",
        "description": "Celadon City (Japanese: タマムシシティ Tamamushi City) is located in central Kanto. It is the most populous city in Kanto and the eighth most populous in the Pokémon world, surpassing even Saffron City in the east. The city has two entrances, one from the east via Route 7, and one from the west via Route 16. Celadon is the main place to spend money in Kanto, through the Celadon Department Store and the Celadon Game Corner. It is the home of the Celadon Condominiums, where residents of the city live, and the Celadon Hotel, where visitors can rest. Celadon is also home to Erika, the city's Gym Leader, and Eusine, the hunter who pursues Suicune.",
        "region": "Kanto",
        "real_name": "Shinjuku, Tokyo (Japanese: 新宿区 東京都)",
        "real_image": [
            "shinjuku.jpeg"
        ],
        "real_notes": "Shinjuku is a major commercial center of Japan known for its business, shopping, and nightlife. The Celadon Department Store may be a reference to the many department stores found in Shinjuku, while the Celadon Game Corner may be a reference to the many pachinko parlors. Similarly, Setagaya has the largest population of Tokyo's special wards, which may be the inspiration for the Celadon Condominiums.",
        "width": 2.2,
        "height": 7,
        "top": 33.6,
        "left": 75
    },
    {
        "id": "batana cave",
        "name": "Cerulean Cave",
        "description": "Cerulean Cave (Japanese: ハナダの洞窟 Hanada Cave), introduced as Unknown Dungeon (Japanese: ななしのどうくつ Nameless Cave), is a cave located in the northwest corner of Cerulean City in Kanto. The cave's moniker would later be reused for the Unknown Dungeon in Kalos, which is a direct reference to Cerulean Cave.",
        "real_name": "Ōya History Museum - Subterranean Cave (Japanese: 大谷資料館 栃木県)",
        "real_image": [
            "oyahistorymuseum.jpeg"
        ],
        "real_notes": "Ōya History Museum used to be a quarry with a network of monumental underground chambers, and is located in Utsunomiya City. Could also be based on Ashio Copper Mine.",
        "region": "Kanto",
        "width": 1,
        "height": 2.5,
        "top": 17.5,
        "left": 80.2
    },
    {
        "id": "k04",
        "name": "Cerulean City",
        "description": "Cerulean City (Japanese: ハナダシティ Hanada City) is a seaside city located in northern Kanto. It is situated near a sea inlet to the north, with Saffron City to the south, and Mt. Moon to the west. It is home to Misty, the Cerulean City Gym Leader. The city is one of only two cities in Kanto to have four different routes enter the city, the other being Saffron City. Cerulean is a mid-sized city with a few attractions, including the Bike Shop and the Berry Powder man.",
        "real_name": "Utsunomiya City, Tochigi (Japanese: 宇都宮市 栃木県)",
        "real_image": [
            "Utsunomiya.jpeg"
        ],
        "real_notes": "Utsunomiya City is the capital city of the Tochigi Prefecture.",
        "region": "Kanto",
        "width": 2.2,
        "height": 7,
        "top": 15.5,
        "left": 81.6
    },
    {
        "id": "j02",
        "name": "Cherrygrove City",
        "description": "Cherrygrove City (Japanese: ヨシノシティ Yoshino City) is located in south-central Johto. Though the city has no Gym, it is frequently passed through by Pokémon Trainers on their way to Violet City from New Bark Town. The city acts mainly as a tutorial, introducing the player to the main tools of the game (the Pokémon Center, the Poké Mart, etc.).",
        "real_name": "Hanada City and Minamichita Town, Aichi (Japanese: 半田市 + 南知多町 愛知県)",
        "real_image": [
            "Hanada.jpeg",
            "Minamichita.jpeg"
        ],
        "real_notes": "Both residences are located in Chita Peninsula, which is famous for flower cultivation. Could possibly be based on Nagoya City, the capital city of the Aichi Prefecture.",
        "region": "Johto",
        "width": 2.2,
        "height": 7,
        "top": 71.3,
        "left": 33.9
    },
    {
        "id": "j08",
        "name": "Cianwood City",
        "description": "Cianwood City (Japanese: タンバシティ Tanba City) is located on the far western edge of Johto, apparently on a totally different landmass than the rest of the region. Due to Cianwood City being at a dead end location in the Johto region, it was not a popular destination. However, in Generation IV it became a notable destination due to the addition of the Safari Zone located to the west of the city. Tales of Lugia and the whirlpools it creates circulate among the sailors that stop in this port town.",
        "real_name": "Naruto City, Tokushima (Japanese: 鳴門市 徳島県)",
        "real_image": ["naruto.jpeg"],
        "real_notes": "Naruto is where Otsuka Pharmaceutical Co. began. Tokushima is the capital city of the prefecture of same name.",
        "region": "Johto",
        "width": 2.2,
        "height": 7,
        "top": 64.3,
        "left": 8.35
    },
    {
        "id": "k10",
        "name": "Cinnabar Island",
        "description": "Cinnabar Island (referred to in Japanese as both グレン島 Guren Island and グレンタウン Guren Town) is a large island located off the southern coast of the Kanto region, south of Pallet Town. It is home to a large volcano. Blaine was once the resident Gym Leader specializing in Fire-type Pokémon, but as of Generation IV, Cinnabar Island no longer has a Gym. Cinnabar is a kind of red mineral, associated with hot springs and volcanoes. The island is connected to the mainland by two water routes: Route 20 in the east and Route 21 in the north, leading to Fuchsia City and Pallet Town, respectively. The journals scattered throughout the abandoned Pokémon Mansion reveal that Mewtwo was created there. The scientists at the Cinnabar Lab (known as the Pokémon Lab prior to Generation VII) have the ability to resurrect Pokémon from their Fossils.",
        "region": "Kanto",
        "real_name": "Izu-Oshima, Tokyo (Japanese: 伊豆大島 東京都)",
        "real_image": ["izuoshima.jpeg"],
        "real_notes": "Oshima is famous for Mount Mihara, an active volcano.",
        "width": 1.6,
        "height": 5.3,
        "top": 89.15,
        "left": 63.6
    },
    {
        "id": "darkcave",
        "name": "Dark Cave",
        "description": "Dark Cave (Japanese: くらやみのほらあな Dark Cave) is a single-level cave located in eastern Johto. Though it is not necessary to enter the cave to complete the storyline, Dark Cave is the only place in the Generation II games to capture wild Dunsparce and Wobbuffet. As its name implies, Flash is required to illuminate the cave. The cave is unique in that the cave is separated into two parts, yet the cave does not change floors between the two areas.",
        "region": "Johto",
        "real_name": "Mino Mikawa Plateau, Nagano Gifu and Aichi (Japanese: 美濃三河高原, 長野県 岐阜県 愛知県)",
        "real_image": ["minomikawa.jpeg"],
        "real_notes": "",
        "width": 1,
        "height": 2.5,
        "top": 48.6,
        "left": 41
    },
    {
        "id": "dark cave south",
        "description": "Dark Cave (Japanese: くらやみのほらあな Dark Cave) is a single-level cave located in eastern Johto. Though it is not necessary to enter the cave to complete the storyline, Dark Cave is the only place in the Generation II games to capture wild Dunsparce and Wobbuffet. As its name implies, Flash is required to illuminate the cave. The cave is unique in that the cave is separated into two parts, yet the cave does not change floors between the two areas.",
        "name": "Dark Cave",
        "region": "Johto",
        "real_name": "Mino Mikawa Plateau, Nagano Gifu and Aichi (Japanese: 美濃三河高原, 長野県 岐阜県 愛知県)",
        "real_image": ["minomikawa.jpeg"],
        "real_notes": "",
        "width": 1,
        "height": 2.5,
        "top": 64.4,
        "left": 38.5
    },
    {
        "id": "darkcave",
        "name": "Dark Cave",
        "description": "Dark Cave (Japanese: くらやみのほらあな Dark Cave) is a single-level cave located in eastern Johto. Though it is not necessary to enter the cave to complete the storyline, Dark Cave is the only place in the Generation II games to capture wild Dunsparce and Wobbuffet. As its name implies, Flash is required to illuminate the cave. The cave is unique in that the cave is separated into two parts, yet the cave does not change floors between the two areas.",
        "region": "Johto",
        "real_name": "Mino Mikawa Plateau, Nagano Gifu and Aichi (Japanese: 美濃三河高原, 長野県 岐阜県 愛知県)",
        "real_image": ["minomikawa.jpeg"],
        "real_notes": "",
        "width": 1,
        "height": 2.5,
        "top": 55,
        "left": 34.5
    },
    {
        "id": "diglett cave north",
        "name": "Diglett's Cave",
        "description": "Diglett's Cave (Japanese: ディグダの穴 Digda's Hole) is a long tunnel dug by wild Diglett and Dugtrio in Kanto. The northern entrance is on Route 2, south of Pewter City, and the southern entrance is on Route 11, near the eastern edge of Vermilion City (although in Generation II, it is located within Vermilion City). The passage is famous for connecting these two routes.",
        "region": "Kanto",
        "real_name": "Kasori Shell Mound, Chiba (Japanese: 加曽利貝塚, 千葉県)",
        "real_image": ["kasorishell.jpeg"],
        "real_notes": "The largest known shell mound found in Japan which can be viewed in a tunnel.",
        "width": 1,
        "height": 2.5,
        "top": 29,
        "left": 63.8
    },
    {
        "id": "diglett tunnel south",
        "name": "Diglett's Cave",
        "description": "Diglett's Cave (Japanese: ディグダの穴 Digda's Hole) is a long tunnel dug by wild Diglett and Dugtrio in Kanto. The northern entrance is on Route 2, south of Pewter City, and the southern entrance is on Route 11, near the eastern edge of Vermilion City (although in Generation II, it is located within Vermilion City). The passage is famous for connecting these two routes.",
        "region": "Kanto",
        "real_name": "Kasori Shell Mound, Chiba (Japanese: 加曽利貝塚, 千葉県)",
        "real_image": ["kasorishell.jpeg"],
        "real_notes": "The largest known shell mound found in Japan which can be viewed in a tunnel.",
        "width": 1,
        "height": 2.5,
        "top": 52.6,
        "left": 84.7
    },
    {
        "id": "j06",
        "name": "Ecruteak City",
        "description": "Ecruteak City (Japanese: エンジュシティ Enju City) is an old-fashioned city located in northern Johto, situated in the woods between tall Mt. Mortar and the open fields near Johto's western shores. As with many of the larger cities in the Pokémon world, Ecruteak has a Pokémon Gym, led by Morty, who specializes in Ghost-type Pokémon and hands out the Fog Badge to those who defeat him.  Ecruteak is known as a historical and mythical city; fittingly, its buildings all feature traditional Japanese architecture. The tallest building in the city, and perhaps all of Johto, is the ten-story Bell Tower in the city's northeast corner, built nearly a millennium before the events of the games. The city is known as being a centerpoint of the Legendary Pokémon native to the Johto region, with the great Ho-Oh once being said to have roosted atop the Bell Tower, and having created three Legendary beasts of the Pokémon who perished when the Brass Tower burned down.",
        "region": "Johto",
        "real_name": "Kyōto City, Kyōto (Japanese: 京都市 京都府)",
        "real_image": ["kyoto.jpeg"],
        "real_notes": "Having served as the seat of the imperial court for eleven centuries, Kyōto is considered to be the cultural capital of Japan. It is the capital city of the prefecture of the same name. The towers that inspired the Burned Tower and the Bell Tower are both located in Kyōto. Kyoto Prefecture is one of Japan's two \"urban prefectures\" using the designation fu (府) rather than the standard ken for prefectures, along with Osaka Prefecture.",
        "width": 2.2,
        "height": 7,
        "top": 37.8,
        "left": 23.4
    },
    {
        "id": "k08",
        "name": "Fuchsia City",
        "description": "Fuchsia City (Japanese: セキチクシティ Sekichiku City) is a city located in southwest Kanto. Its most distinguishing features are the Safari Zone in the Generation I and III games and the Poison-type Gym. Koga is the Fuchsia City Gym Leader until his daughter Janine takes over in the Generation II and IV games. Route 15 leads into the city from the east, Route 18 from the west, and the beach of Route 19 is in the south.",
        "region": "Kanto",
        "real_name": "Futtsu City, Tateyama City, or Minamibōsō City, Chiba (Japanese: 館山市, 富津市, or 南房総市 千葉県)",
        "real_image": ["tateyama.jpeg","minamiboso.jpeg"],
        "real_notes": "All three cities are located close to the Minami Bōsō Quasi-National Park. Tateyama City contains many historic buildings. The Minami Bōsō Ninja Village “Ninja no Sato” is located in Minamibōsō City, relating to Koga's status as a ninja.",
        "width": 2.2,
        "height": 7,
        "top": 33.6,
        "left": 81.6
    },
    {
        "id": "j05",
        "name": "Goldenrod City",
        "description": "Goldenrod City (Japanese: コガネシティ Kogane City) is a sprawling metropolis located in western Johto. It is the largest city in the region, and one of the largest cities in the Pokémon world. Goldenrod is the center of the region's economy and telecommunications. Major attractions for Trainers include the Goldenrod Radio Tower, the city's Department Store, Game Corner, Name Rater, Magnet Train, Global Terminal,HGSS and Gym. Pokémon Trainers often come to Goldenrod City in order to win the Plain Badge from Whitney, the Goldenrod Gym Leader, who specializes in Normal-type Pokémon. The National Park, along with the Pokéathlon Dome, is located north of Goldenrod off Route 35 while the Pokémon Day Care is just south of the city on Route 34.",
        "region": "Johto",
        "real_name":"Ōsaka City, Ōsaka (Japanese: 大阪市, 大阪府)",
        "real_image": ["osaka.webp"],
        "real_notes": "Ōsaka is the largest and most populous city in the Kansai region, serving as a major hub and financial center in the country. It is also the capital city of the Urban Prefecture of Osaka. Osaka Prefecture is one of Japan's two \"urban prefectures\" using the designation fu (府) rather than the standard ken for prefectures, along with Kyoto Prefecture.",
        "width": 2.2,
        "height": 7,
        "top": 64.3,
        "left": 21.65
    },
    {
        "id": "icepath",
        "name": "Ice Path",
        "description": "The Ice Path (Japanese: こおりのぬけみち Ice Path) is a four-floored cave located in the Johto region that connects Route 44 with Blackthorn City. The Ice Path has numerous ice puzzles, which vary in size and difficulty, such as a Strength puzzle involving pushing boulders into holes in order to progress. It is the only place in Johto where wild Swinub, Jynx, and Delibird can be caught.",
        "region": "Johto",
        "real_name": "Ibuki Mountains and Ryōhaku Mountains, Gifu and Shiga (Japanese: 伊吹山/両白山地, 岐阜県/滋賀県)",
        "real_image": ["ibuki.webp"],
        "real_notes": "Mount Ibuki is an easy-to-climb mountain that is famous for receiving the world's heaviest recorded snowfall. The interiors could be based on Narusawa Ice Cave, but geographically it's too far away from both mountains.",
        "width": 1,
        "height": 2.5,
        "top": 40,
        "left": 38.5
    },
    {
        "id": "ubame forest",
        "name": "Ilex Forest",
        "description": "Ilex Forest (Japanese: ウバメの森 Ubame Forest) is a dense forest located in southern Johto, directly west of Azalea Town. The forest's trees are so close together that all light is blocked out, and in Generation II, the forest seems to be in a perpetual night. There is a shrine for the guardian of the forest, Celebi. In Pokémon Crystal, if Kurt has already examined the GS Ball, placing it in the shrine will cause a level 30 Celebi to face the player. Though the GS Ball was never distributed as an event item outside of Japan, the Virtual Console release of Crystal allows it to be obtained in all regions through normal gameplay. In Pokémon HeartGold and SoulSilver, the Shrine also may initiate a special event in which Celebi will take the player back in time and allow them to battle Giovanni.",
        "real_name": "Kumano Kodo, Wakayama (Japanese: 熊野古道 和歌山県)",
        "real_image": ["kumano kodo.jpeg"],
        "real_notes": "The Kumano Kodō is a series of ancient pilgrimage routes spread across the old-growth forest that connects various sacred shrines that have been sites for centuries of ascetic worship of natural phenomenon and natural wonders.",
        "width": 1,
        "region": "Johto",
        "height": 2.5,
        "top": 82,
        "left": 22.2
    },
    {
        "id": "j12",
        "name": "Indigo Plateau",
        "description": "The Indigo Plateau (Japanese: セキエイこうげん Sekiei Plateau) serves as the capital for the Pokémon League in the Kanto region. It is the final destination for Pokémon Trainers collecting Indigo or Johto League Badges. This is where the Trainers who have defeated all of the eight Gym Leaders of either Kanto or Johto battle against the Elite Four and the Pokémon Champion. Trainers must venture through Victory Road, a lengthy cave acting as a final test for Trainers. The Elite Four must be battled consecutively, with breaks to the Pokémon Center prohibited. Trainers are unable to go back or return to previous rooms. The only way to open the door and progress through each room is to defeat the Elite Four member of that room. Each member of the Elite Four is stronger than the previous member, and like Gym Leaders, each specializes in a different type.",
        "region": "Johto",
        "width": 4.5,
        "height": 7,
        "top": 8.5,
        "left": 54.15
    },
    {
        "id": "lake",
        "name": "Lake of Rage",
        "description": "The Lake of Rage (Japanese: いかりのみずうみ Lake of Rage), also known as Gyarados Lake (Japanese: ギャラドスこ Gyarados Lake), is a location in Johto. It is located just north of Mahogany Town, connecting it with Route 43, making it the northern-most accessible point of the Johto region. A large lake spans the area of the Lake of Rage, with a few residents living nearby. It is said to be the largest lake in the region. West of the lake lies a labyrinth of trees, which hides a house. It is said the Lake of Rage was created the last time many Gyarados got together and stirred up a storm. The crater that remained filled with rainwater and became the Lake of Rage. In the middle of the lake dwells a Shiny Gyarados that had recently became irritable due to the radio waves transmitted by Team Rocket from their hideout in Mahogany Town. The Lake of Rage was considered a dangerous place to go, as the red Gyarados started tipping over boats and scaring swimmers.",
        "region": "Johto",
        "real_name": "Lake Biwa, Shiga (Japanese: 琵琶湖 滋賀県)",
        "real_image": ["biwa.jpeg"],
        "real_notes": "Lake Biwa is the largest lake in Japan.",
        "width": 1,
        "height": 2.5,
        "top": 20,
        "left": 32.8
    },
    {
        "id": "k06",
        "name": "Lavender Town",
        "description": "Lavender Town (Japanese: シオンタウン Cion Town) is a small town located in northeast Kanto, just south of the Rock Tunnel. The citizens of Lavender Town in Generations I, III, and VII claim Lavender Town is known mainly for ghost sightings in the Pokémon Tower and as the main gravesite of Pokémon. In Generations II and IV, the town is noticeably modernized with the inclusion of a broadcasting station. The citizens claim the ghosts that appear in the Tower are the spirits of Pokémon that have died.  North of Lavender is Route 10 and the Rock Tunnel. West of the town is Route 8, while to the south is Route 12 and the Silence Bridge.",
        "region": "Kanto",
        "real_name": "Ushiku City, Ibaraki (Japanese: 牛久市 茨城県)",
        "real_image": ["ushiku.png"],
        "real_notes": "Geographically, it is closer to Kashima City. However, Ushiku City contains Ushiku Jyoen - a large scale graveyard that allows people to bury passed away pets. It also contains a small animal park, where people can feed various animals.",
        "width": 1.6,
        "height": 5.3,
        "top": 34.65,
        "left": 90.7
    },
    {
        "id": "j09",
        "name": "Mahogany Town",
        "description": "Mahogany Town (Japanese: チョウジタウン Chōji Town) is a small town in northern Johto where ninjas once resided in what eventually became the Team Rocket HQ. There are three exits out of town. To the west is Route 42, to the east is Route 44, and to the north is Route 43, which leads directly to the famous Lake of Rage. Pokémon Trainers must come to Mahogany Town in order to win the Glacier Badge from Pryce, the Mahogany Gym Leader who specializes in Ice-type Pokémon. Mahogany is a quiet, relaxed town, and has no Poké Mart. Instead, there is a shop used by Team Rocket as a base. After Team Rocket is defeated, it is converted into a store run by a little old lady. When the town is first entered, there is a man blocking the eastern exit to Route 44 and the Ice Path who wants to sell the player a RageCandyBar. In Generation II, he will disappear after the player obtains seven Johto Badges. In HeartGold and SoulSilver, because the RageCandyBar is a Key Item, the man will then say that the player needs to see the attractions in the town and the surrounding area, and he will continue to block the eastern exit until the player has defeated Team Rocket at the Goldenrod Radio Tower.",
        "region": "Johto",
        "real_name":"Kōka City, Shiga (Japanese: 甲賀市, 滋賀県)",
        "real_image": ["koka.jpeg"],
        "real_notes": "Kōka is where the famous Kōga ninja were born and educated (Kōga-ryū, 甲賀流).",
        "width": 1.6,
        "height": 5.3,
        "top": 38.55,
        "left": 32.5
    },
    {
        "id": "moon mountain",
        "name": "Mt. Moon",
        "description": "Mt. Moon (Japanese: お月見山 Mt. Otsukimi), formatted as Mount Moon in Pokémon Brilliant Diamond and Shining Pearl, is a mountain located in northern Kanto, between Pewter City in the west and Cerulean City in the east. It also provides access to Mt. Moon Square in Generations II and IV. Climbing does not seem to be possible; to get past it, travelers always need to travel through the caves. Mt. Moon is known for being one of the few places where wild Clefairy can be found and for its frequent meteor falls. The shards of meteorites that fall here become Moon Stones, which explains the mountain's name. The mountain is also known for being home to Pokémon Fossils. Brock digs for Fossils here in his spare time.",
        "region": "Kanto",
        "real_name": "Mount Akagi, Gunma (Japanese: 赤城山, 群馬県)",
        "real_image": ["akagi.jpg"],
        "real_notes": "Mt. Akagi features a crater lake near the summit",
        "width": 1,
        "height": 2.5,
        "top": 17.5,
        "left": 73.24
    },
    {
        "id": "mortar",
        "name": "Mt. Mortar",
        "description": "Mt. Mortar (Japanese: スリバチ山 Mt. Suribachi) is a large cave in Johto with three entrances on Route 42. Part of the large range of mountains north of the Johto region, it is known to be a confusing maze-like area with an interior cave known as the Waterfall Cave. It is an optional cave to enter, but contains many valuable items and Pokémon. The player can pass through the mountain caves to bypass the lakes on Route 42. It is the training place of Kiyo, the Karate King from Saffron City. He will reward the player with a level 10 Tyrogue upon defeat",
        "region": "Johto",
        "real_name": "Mount Hiei, Shiga (Japanese: 比叡山, 滋賀県)",
        "real_image": ["hiei.jpeg"],
        "real_notes": "/“Marathon Monks/” would undergo exhaustive exercises on Mount Hiei. Kiyo trains in isolation deep within Mt. Mortar.",
        "width": 1,
        "height": 2.5,
        "top": 40,
        "left": 28.6
    },
    {
        "id": "silver mt",
        "name": "Mt. Silver",
        "description": "Mt. Silver (Japanese: シロガネ山 Mt. Shirogane) is a large mountain in Johto located west of Victory Road and Indigo Plateau. The location is also referred to as Silver Cave (Japanese: シロガネやま Mt. Shirogane) in Pokémon Gold, Silver, and Crystal or Mt. Silver Cave (Japanese: シロガネやまどうくつ Mt. Shirogane Cave) in Pokémon HeartGold and SoulSilver. Mt. Silver can be reached from Kanto via Route 28 after receiving the sixteen Gym Badges of both Johto and Kanto. At the very summit of Mt. Silver, the player may battle Red. If defeated, Red vanishes from Mt. Silver, and returns every time the Elite Four is defeated again by the player. In Pokémon HeartGold and SoulSilver, Moltres can also be found here.",
        "region": "Johto",
        "real_name": "Mount Fuji, Shizouka and Yamanashi (Japanese: 富士山, 静岡県 and 山梨県)",
        "real_image": ["fuji.jpeg"],
        "real_notes": "The encounter with Red at Mt. Silver may be a reference to Kuninotokotachi. Waiting atop Mt. Silver as the series' highest-level Trainer opponent, Red was the player character with humble beginnings from the first Pokémon games; Kuninotokotachi is said to be the first Japanese deity, born of something resembling a reed following the creation of heaven and earth, who resides atop Mt. Fuji.",
        "width": 1,
        "height": 2.5,
        "top": 47.5,
        "left": 47.15
    },
    {
        "id": "nationalpark",
        "name": "National Park",
        "description": "The National Park (Japanese: しぜんこうえん Nature Park) is a location in Johto. It is located to the north of Goldenrod City, between Route 35 and Route 36. The Bug-Catching Contest takes place there every Tuesday, Thursday, and Saturday.",
        "region": "Johto",
        "real_name": "Meiji no Mori Minoo Quasi-National Park or Expo Commemoration Park, Ōsaka (Japanese: 明治の森箕面国定公園 or 万博記念公園, 大阪府)",
        "real_image": ["meiji.jpeg", "expo.jpeg"],
        "real_notes": "",
        "width": 1,
        "height": 2.5,
        "top": 49.8,
        "left": 22.2
    },
    {
        "id": "j01",
        "name": "New Bark Town",
        "description": "New Bark Town (Japanese: ワカバタウン Wakaba Town) is located in southeastern Johto and is the hometown of the Johto player character. It is home to the lab of Professor Elm, who possesses the starter Pokémon for Johto: Chikorita, Cyndaquil, and Totodile. Other than being connected to Route 29 in the west, it is also the town that must be passed through to reach Tohjo Falls, Victory Road, and Indigo Plateau, via Route 26 and Route 27.",
        "region": "Johto",
        "real_name":"Hamamatsu City, Shizuoka (Japanese: 浜松市, 静岡県)",
        "real_image": ["hamamatsu.jpeg"],
        "real_notes": "",
        "width": 1.6,
        "height": 5.3,
        "top": 72.2,
        "left": 42.45
    },
    {
        "id": "j07",
        "name": "Olivine City",
        "description": "Olivine City (Japanese: アサギシティ Asagi City) is located on the Johto coast, near Ecruteak City and Cianwood City. Olivine is a major port city and is the home of the Glitter Lighthouse. The Glitter Lighthouse guides ships to the harbor as well as the S.S. Aqua connecting it to the port city in its sister region, Vermilion City in Kanto. Pokémon Trainers often come to Olivine City in order to win the Mineral Badge from Jasmine, the Olivine Gym Leader who specializes in Steel-type Pokémon.",
        "region": "Johto",
        "real_name": "Kōbe City, Hyōgo (Japanese: 神戸市, 兵庫県)",
        "real_image": ["kobe.jpeg"],
        "real_notes": "Kōbe is the major port city in the Kansai region. The city is also well known for wagyū, or Kobe beef. Is the capital city of the Hyogo Prefecture.",
        "width": 2.2,
        "height": 7,
        "top": 47,
        "left": 16.4
    },
    {
        "id": "k01",
        "name": "Pallet Town",
        "description": "Pallet Town (Japanese: マサラタウン Masara Town) is a small town located in southwestern Kanto. It is the hometown of the player and their rival in the Kanto-based games. In other games, it is specifically the hometown of Red and Blue. In the anime, it is the hometown of Ash and Gary. Professor Oak's Laboratory, where the famous Professor Oak conducts his research, is located in the town. The town has two exits. To the north is Route 1, leading to Viridian City. To the south is Route 21, a water route leading to Cinnabar Island.",
        "region": "Kanto",
        "real_name":"Shimoda City, Shizuoka (Japanese: 下田市, 静岡県)",
        "real_image": ["shimoda.jpeg"],
        "real_notes": "",
        "width": 1.6,
        "height": 5.3,
        "top": 63.9,
        "left": 63.6
    },
    {
        "id": "k03",
        "name": "Pewter City",
        "description": "Pewter City (Japanese: ニビシティ Nibi City) is a city located in northwestern Kanto. The most notable resident of the city is Brock, a Rock-type expert and the Leader of the Pewter Gym. The city has two exits. To the east is Route 3, leading to Route 4 and Mt. Moon. To the south is Route 2, leading to Viridian City.",
        "region": "Kanto",
        "real_name":"Maebashi City, Gunma (Japanese: 前橋市, 群馬県)",
        "real_image": ["maebashi.jpeg"],
        "real_notes": "Maebashi rests at the foot of Mount Akagi. It is the capital city of the Gunma Prefecture. The famous Iwajuku archaeological site and the Iwajuku Museum are located in the city of Midori.",
        "width": 2.2,
        "height": 7,
        "top": 19.5,
        "left": 63.21
    },
    {
        "id": "power plant",
        "name": "Power Plant",
        "description": "The Power Plant (Japanese: 無人発電所 Abandoned Power Plant in Generations I, III, and VII, 発電所 Power Plant in Generations II and IV), occasionally referred to as the Kanto Power Plant (Japanese: カントーはつでんしょ Kanto Power Plant) in Generations II and IV, is a facility located on Route 10 in Kanto.",
        "region": "Kanto",
        "real_name":"Tōkai Nuclear Power Plant, Ibaraki (Japanese: 東海発電所, 茨城県)",
        "real_image": ["tokai.jpeg"],
        "real_notes": "The first commercial nuclear power plant in Japan.",
        "width": 1,
        "height": 2.5,
        "top": 21.2,
        "left": 92.1
    },
    {
        "id": "iwayama tunnel",
        "name": "Rock Tunnel",
        "description": "The Rock Tunnel (Japanese: イワヤマトンネル Rock Mountain Tunnel) is a naturally formed underground tunnel. Since it has not been developed, it is pitch black inside. A light of some sort is needed for travelers to find their way, so it is recommended that Pokémon Trainers bring along a Pokémon that can use Flash outside of battle. Rock Tunnel is the only alternative route to Lavender Town, as the two other routes have been rendered inaccessible by a slumbering Snorlax and the Saffron City gatekeepers. The cave has two separate floors, both of which are roughly the same size. There are many Trainers within the cave, there for the fun of exploring, training, or are simply lost in the darkness. Route 10 leads from Cerulean City to Rock Tunnel. At the northern entrance of the cave is a convenient Pokémon Center. The roof of the Kanto Power Plant can also be seen from here (excluding Generation III). The southern entrance exits onto the remainder of Route 10, leading to Lavender Town.",
        "region": "Kanto",
        "real_name": "Mount Tsukuba, Ibaraki (Japanese: 筑波山, 茨城県)",
        "real_image": ["tsukuba.jpeg"],
        "real_notes": "A non-volcanic mountain renowned for its beautiful granite.",
        "width": 1,
        "height": 2.5,
        "top": 17.5,
        "left": 91
    },
    {
        "id": "alpharuins",
        "name": "Ruins of Alph",
        "description": "The Ruins of Alph (Japanese: アルフの遺跡 Ruins of Alph) are located in Johto near Violet City, with entrances to the south of Route 36 and west of Route 32. The ruins are filled with Unown once any of the four slide puzzles inside the chambers have been activated. The name may come from the first four letters of \"alphabet,\" which the Unown inside represent. If the player listens to the Pokégear radio while near or inside the ruins, they will hear strange noises known as Mysterious Transmission on channel 13.5. In Pokémon HeartGold and SoulSilver, the player must be inside one of the chambers, and tuning the radio near the center will broadcast these noises. Some of those noises are actually Ho-Oh's distorted cries, and the melody of the Azure Flute. It also increases the chance of encountering an Unown shape the player has not yet encountered.",
        "region": "Johto",
        "real_name": "Asuka Village, Nara (Japanese: 明日香村, 奈良県)",
        "real_image": ["asuka.jpeg"],
        "real_notes": "There are many archaeological sites in Nara such as Ishibutai Kofun (石舞台古墳) and Takamatsuzuka Tomb (高松塚古墳).",
        "width": 1,
        "height": 2.5,
        "top": 57.5,
        "left": 26.2
    },
    {
        "id": "safari Zone",
        "name": "Safari Zone",
        "description": "The Johto Safari Zone (Japanese: サファリゾーン Safari Zone) is a special Pokémon preserve where Trainers can capture certain types of Pokémon. The Johto Safari Zone made its debut appearance in Pokémon HeartGold and SoulSilver, where it was shown to be located northwest of Cianwood. It is located at the Safari Zone Gate, a bazaar that sprung up due to the Safari Zone's popularity. It is owned by Baoba, the owner of the former Kanto Safari Zone, which was, by then, made into a Pal Park by his son. The Safari Zone can only be accessed once the player has healed the sick Ampharos, Amphy, in Olivine City's Glitter Lighthouse.",
        "region": "Johto",
        "real_name": "Marugame City, Kagawa (Japanese: 丸亀市 香川県)",
        "real_image": ["marugame.jpeg", "reoma.jpeg"],
        "real_notes": "NEW REOMA WORLD amusement park is based here, which contains an animal park.",
        "width": 1,
        "height": 2.5,
        "top": 64.3,
        "left": 0.5
    },
    {
        "id": "k09",
        "name": "Saffron City",
        "description": "Saffron City (Japanese: ヤマブキシティ Yamabuki City) is a sprawling metropolis in the Kanto region. It lies in between Celadon City, Vermilion City, Lavender Town, and Cerulean City. It is home to Sabrina, the city's Gym Leader. It is modeled after Japan's capital city of Tokyo and is the largest and one of the busiest cities in Kanto, being famous even in other regions. It is the tenth most populous city in the Pokémon world and one of the only cities in Kanto that has enough visible houses to accommodate its population in the games. The large Silph Co. headquarters building stands firm as the city's centerpiece while two Gyms dominate the northeastern corner district. Not only is this the central business district of Kanto, it also holds the region's largest infrastructure, including the Magnet Train station, which allows ease of access between Kanto and Johto.",
        "region": "Kanto",
        "real_name": "Chiyoda, Tokyo (Japanese: 千代田区, 東京都)",
        "real_image": ["chiyoda.webp"],
        "real_notes": "Chiyoda is a major economical powerhouse of Japan, housing the headquarters of 19 Fortune 500 companies that contribute roughly 10% of the combined revenue of all Japanese companies. The Silph Co. headquarters being located in Saffron City may reflect this. Chiyoda is also the political center of Japan: the Imperial Palace, Prime Minister's Official Residence, the National Diet and the Supreme Court are located here.",
        "width": 2.2,
        "height": 7,
        "top": 72,
        "left": 75.6
    },
    {
        "id": "twin island",
        "name": "Seafoam Islands",
        "description": "The Seafoam Islands (Japanese: 双子島 Twin Islands) are a pair of islands that are situated on Route 20. The two islands are shaped the same, as if they were twins.",
        "region": "Kanto",
        "real_name": "Enoshima, Kanagawa (Japanese: 江の島, 神奈川県)",
        "real_image": ["enoshima.jpeg"],
        "real_notes": "A small offshore island. Home to the Iwaya Caves.",
        "width": 1,
        "height": 2.5,
        "top": 90.5,
        "left": 70.6
    },
    {
        "id": "waterfall",
        "name": "Tohjo Falls",
        "description": "The Tohjo Falls (Japanese: トージョウの滝 Tōjō Falls) are two waterfalls separating the Johto and Kanto regions, and known as The Link Between Kanto and Johto.",
        "region": "Johto",
        "real_name": "Suruga Bay, Shizuoka (Japanese: 駿河湾, 静岡県)",
        "real_image": ["suruga.jpeg"],
        "real_notes": "Both Shiraito Falls and Otodome Falls, the real world Tohjo Falls, are located close to the bay. Two waterfalls separated by a mere 600 feet, located southwest of Mount Fuji.",
        "width": 1,
        "height": 2.5,
        "top": 73.5,
        "left": 46.7
    },
    {
        "id": "union cave",
        "name": "Union Cave",
        "description": "Union Cave (Japanese: つながりのどうくつ Linking Cave) is a cave located in the Johto region. The main cave divides Route 32 from Route 33, though two other exits in the basement levels of the cave lead to the Ruins of Alph. A wild Lapras can also be encountered deep in the cave every Friday after Morty has been defeated (as Surf is required to get to it).",
        "region": "Johto",
        "real_name": "Blue Grotto, Mie (Japanese: 青の洞窟, 三重県)",
        "real_image": ["blue grotto.jpeg"],
        "real_notes": "The Blue Grotto of Kumano is a small sea cave in Tategasaki, the largest columnar rock formation in Nigishima Bay.",
        "width": 1,
        "height": 2.5,
        "top": 82,
        "left": 28
    },
    {
        "id": "k05",
        "name": "Vermilion City",
        "description": "Vermilion City (Japanese: クチバシティ Kuchiba City) is a city in Kanto. Situated near a sea inlet to the south, it serves as a popular sea port for ships such as the S.S. Anne. Vermilion Harbor is a home port for many ships. The S.S. Anne sails around the world and returns to Vermilion once a year. The S.S. Aqua sails from Olivine City in Johto to Vermilion Harbor. The Seagallop Ferries sail regularly to all of the Sevii Islands. Aside from the harbor, the other exits to the city are Route 11 and Diglett's Cave to the east. North of the city is Route 6.",
        "region": "Kanto",
        "real_name": "A hybrid of Yokohama City/Yokosuka City/Chiba City, Kanagawa/Chiba (Japanese: 横浜市/横須賀市/千葉市, 神奈川県/千葉県)",
        "real_image": ["yokohama.webp","yokosuka.jpeg", "chiba.jpeg"],
        "real_notes": "Geographically, it is based on Chiba City (capital city of the Chiba Prefecture). However, Yokohama (capital city of the Kanagawa Prefecture) is the largest and most luxurious seaport of the three. Yokosuka has a United States Navy base, a possible inspiration for Vermilion Gym and Lt. Surge as an 'American' soldier.ring the announcement for the 2023 Pokémon World Championships, The Pokémon Company used a trailer with footage of Vermilion City taken from the Generation I games before announcing that the event would be held in Yokohama.",
        "width": 2.2,
        "height": 7,
        "top": 50.3,
        "left": 81.6
    },
    {
        "id": "j11",
        "name": "Victory Road",
        "description": "Victory Road (Japanese: チャンピオンロード Champion Road) is a tunnel situated on Route 23. It earned its name because it must be traveled by all Trainers aiming for the top. Its other end opens up in Indigo Plateau and the Pokémon League. Only Trainers with the eight Kanto or Johto Badges are allowed to enter it.",
        "region": "Johto",
        "width": 4.5,
        "height": 7,
        "top": 26.8,
        "left": 54.15
    },
    {
        "id": "j03",
        "name": "Violet City",
        "description": "Violet City (Japanese: キキョウシティ Kikyō City) is located in central Johto. It is the third city encountered in Johto by the player. Pokémon Trainers often come to Violet City in order to win the Zephyr Badge from Falkner, the Violet Gym Leader, who specializes in Flying-type Pokémon. The city has three entrances, one from the east via Route 31, one from the south via Route 32, and one from the west via Route 36.",
        "region": "Johto",
        "real_name": "Nara City, Nara (Japanese: 奈良市, 奈良県)",
        "real_image": ["nara.jpeg"],
        "real_notes": "Home to many historic buildings and monuments, Nara is where Japan was founded as a state. It was the capital of Japan from 710 CE to 794 CE as the seat of the Emperor before the capital was moved to Kyoto. Currently is the capital city of the Nara Prefecture.",
        "width": 2.2,
        "height": 7,
        "top": 47.5,
        "left": 29
    },
    {
        "id": "k02",
        "name": "Viridian City",
        "description": "Viridian City (Japanese: トキワシティ Tokiwa City) is a small city located in western Kanto. It is home to the Viridian Gym, which can only be challenged by the player once they have obtained the Badges of the seven other Gyms of Kanto. In the Kanto-based games, the Gym Leader is Giovanni, the boss of Team Rocket and a Ground-type expert. After being defeated, he abandons the Gym and is replaced by Blue, who has no specialty type. He is the Gym Leader during the events of the Johto-based games. The city has three exits. To the north is Route 2, divided into two by Viridian Forest and leading to Pewter City. To the south is Route 1, leading to Pallet Town. To the west is Route 22, leading to the Pokémon League Reception Gate. In the Generation II games and Pokémon HeartGold and SoulSilver, the city is known as 'the Gateway to Indigo Plateau'.",
        "region": "Kanto",
        "real_name": "Mishima City or Hakone Town, Shizuoka or Kanagawa (Japanese: 三島市 or 箱根町, 静岡県 or 神奈川県)",
        "real_image": ["mishima.jpeg", "hakone.jpeg"],
        "real_notes": "",
        "width": 2.2,
        "height": 7,
        "top": 45.6,
        "left": 63.21
    },
    {
        "id": "tokiwa forest",
        "name": "Viridian Forest",
        "description": "Viridian Forest (Japanese: トキワの森 Tokiwa Forest) is a forest which lies between Viridian City and Pewter City in the middle of Route 2 with both the north and south entrances of Viridian Forest open to the route. The deep and sprawling forest is said to be a natural maze as many people get lost inside. The trees in the forest are so thick that little light gets in, and because of this the forest is full of Bug- and Flying-type Pokémon that attract Bug Catchers and other Trainers. In Generation II, Viridian Forest no longer exists as a standalone area and has been replaced with a maze of standard trees, containing items and Berry trees, which is now a part of Route 2. The maze forms roughly the same design as before and the items are placed similarly to those located in Generations I, III, and VII. However, in the Generation IV remakes, the forest is re-expanded into the state of an actual dungeon, with five Trainers added, and with Pokémon similar to those of Pokémon Yellow.",
        "region": "Kanto",
        "real_name": "Okuchichibu Mountains, Yamanashi or Saitama or Nagano (Japanese: 奥秩父山塊, 埼玉県 or 山梨県 or 長野県)",
        "real_image": ["okuchichibu.jpg"],
        "real_notes": "",
        "width": 1,
        "height": 2.5,
        "top": 35,
        "left": 63.8
    },
    {
        "id": "whirl",
        "name": "Whirl Islands",
        "description": "The Whirl Islands (Japanese: うずまきじま Whirlpool Islands) are a small archipelago located between the mainland of Johto and Cianwood City, on Route 41. Beneath the sea, a maze of dark caves sprawl, with explorers able to travel between the four islands with some amount of difficulty. Deep within these caves, Lugia can be found once the player has obtained the Silver Wing and Tidal BellSS. Named after the dangerous whirlpools that surround them, some parts of the Whirl Islands are mysterious and largely inaccessible. Children in Olivine City are told that bad kids are sent to the islands. As explained in Pokémon SoulSilver, the Whirl Islands used to be one large island. At some point in time, there were two countries fighting over the island. Lugia, the guardian of the island, got upset and cast lightning bolts to tear the island into four pieces. It then disappeared into the deep end of the waterfall basin, longing for the invisible trust between people and Pokémon to manifest once more.",
        "region": "Johto",
        "real_name": "Awajishima, Hyōgo (Japanese: 淡路島, 兵庫県)",
        "real_image": ["awajishima.webp"],
        "real_notes": "The Naruto Strait between Awajishima and Shikoku is famous for the Naruto whirlpools. Soul Silver describes Lugia splitting one island into the Whirl Islands to end a war; Awajishima was the epicenter of the Great Hanshin earthquake, with a portion of the island's damaged fault zone preserved to this day.",
        "width": 1,
        "height": 2.5,
        "top": 66.5,
        "left": 14
    }
]